{"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_4"}, "name": "input_4", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "MobilenetV3small", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_1", "trainable": true, "dtype": "float32", "scale": 0.00392156862745098, "offset": 0.0}, "name": "rescaling_1", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv", "inbound_nodes": [[["rescaling_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "Conv/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "Conv/BatchNorm", "inbound_nodes": [[["Conv", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_28", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_28", "inbound_nodes": [["Conv/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_33", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_33", "inbound_nodes": [[["tf.__operators__.add_28", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_28", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_28", "inbound_nodes": [["re_lu_33", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_19", "trainable": true, "dtype": "float32"}, "name": "multiply_19", "inbound_nodes": [[["tf.math.multiply_28", 0, 0, {}], ["Conv/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv/depthwise/pad", "inbound_nodes": [[["multiply_19", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv/depthwise", "inbound_nodes": [[["expanded_conv/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_34", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_34", "inbound_nodes": [[["expanded_conv/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv/squeeze_excite/AvgPool", "inbound_nodes": [[["re_lu_34", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_9", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 16]}, "name": "reshape_9", "inbound_nodes": [[["expanded_conv/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv", "inbound_nodes": [[["reshape_9", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_29", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_29", "inbound_nodes": [["expanded_conv/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_35", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_35", "inbound_nodes": [[["tf.__operators__.add_29", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_29", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_29", "inbound_nodes": [["re_lu_35", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv/squeeze_excite/Mul", "inbound_nodes": [[["re_lu_34", 0, 0, {}], ["tf.math.multiply_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv/project", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv/project", "inbound_nodes": [[["expanded_conv/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv/project/BatchNorm", "inbound_nodes": [[["expanded_conv/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/expand", "trainable": true, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/expand", "inbound_nodes": [[["expanded_conv/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_1/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_36", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_36", "inbound_nodes": [[["expanded_conv_1/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_1/depthwise/pad", "inbound_nodes": [[["re_lu_36", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_1/depthwise", "inbound_nodes": [[["expanded_conv_1/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_1/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_37", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_37", "inbound_nodes": [[["expanded_conv_1/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1/project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1/project", "inbound_nodes": [[["re_lu_37", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1/project/BatchNorm", "inbound_nodes": [[["expanded_conv_1/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/expand", "trainable": true, "dtype": "float32", "filters": 88, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/expand", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_2/expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_38", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_38", "inbound_nodes": [[["expanded_conv_2/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_2/depthwise", "inbound_nodes": [[["re_lu_38", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_2/depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_39", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_39", "inbound_nodes": [[["expanded_conv_2/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2/project", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2/project", "inbound_nodes": [[["re_lu_39", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2/project/BatchNorm", "inbound_nodes": [[["expanded_conv_2/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_2/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_2/Add", "inbound_nodes": [[["expanded_conv_1/project/BatchNorm", 0, 0, {}], ["expanded_conv_2/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/expand", "inbound_nodes": [[["expanded_conv_2/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_3/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_30", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_30", "inbound_nodes": [["expanded_conv_3/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_40", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_40", "inbound_nodes": [[["tf.__operators__.add_30", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_30", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_30", "inbound_nodes": [["re_lu_40", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_20", "trainable": true, "dtype": "float32"}, "name": "multiply_20", "inbound_nodes": [[["tf.math.multiply_30", 0, 0, {}], ["expanded_conv_3/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3/depthwise/pad", "trainable": true, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "expanded_conv_3/depthwise/pad", "inbound_nodes": [[["multiply_20", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_3/depthwise", "inbound_nodes": [[["expanded_conv_3/depthwise/pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_3/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_31", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_31", "inbound_nodes": [["expanded_conv_3/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_41", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_41", "inbound_nodes": [[["tf.__operators__.add_31", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_31", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_31", "inbound_nodes": [["re_lu_41", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_21", "trainable": true, "dtype": "float32"}, "name": "multiply_21", "inbound_nodes": [[["tf.math.multiply_31", 0, 0, {}], ["expanded_conv_3/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_3/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_21", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_10", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 96]}, "name": "reshape_10", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv", "inbound_nodes": [[["reshape_10", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_3/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_3/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_32", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_32", "inbound_nodes": [["expanded_conv_3/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_42", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_42", "inbound_nodes": [[["tf.__operators__.add_32", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_32", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_32", "inbound_nodes": [["re_lu_42", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_3/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_3/squeeze_excite/Mul", "inbound_nodes": [[["multiply_21", 0, 0, {}], ["tf.math.multiply_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3/project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3/project", "inbound_nodes": [[["expanded_conv_3/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3/project/BatchNorm", "inbound_nodes": [[["expanded_conv_3/project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/expand", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_4/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_33", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_33", "inbound_nodes": [["expanded_conv_4/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_43", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_43", "inbound_nodes": [[["tf.__operators__.add_33", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_33", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_33", "inbound_nodes": [["re_lu_43", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_22", "trainable": true, "dtype": "float32"}, "name": "multiply_22", "inbound_nodes": [[["tf.math.multiply_33", 0, 0, {}], ["expanded_conv_4/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_4/depthwise", "inbound_nodes": [[["multiply_22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_4/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_34", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_34", "inbound_nodes": [["expanded_conv_4/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_44", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_44", "inbound_nodes": [[["tf.__operators__.add_34", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_34", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_34", "inbound_nodes": [["re_lu_44", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_23", "trainable": true, "dtype": "float32"}, "name": "multiply_23", "inbound_nodes": [[["tf.math.multiply_34", 0, 0, {}], ["expanded_conv_4/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_4/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_23", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_11", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 192]}, "name": "reshape_11", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv", "inbound_nodes": [[["reshape_11", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_4/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_4/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_35", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_35", "inbound_nodes": [["expanded_conv_4/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_45", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_45", "inbound_nodes": [[["tf.__operators__.add_35", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_35", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_35", "inbound_nodes": [["re_lu_45", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_4/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_4/squeeze_excite/Mul", "inbound_nodes": [[["multiply_23", 0, 0, {}], ["tf.math.multiply_35", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4/project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4/project", "inbound_nodes": [[["expanded_conv_4/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4/project/BatchNorm", "inbound_nodes": [[["expanded_conv_4/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_4/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_4/Add", "inbound_nodes": [[["expanded_conv_3/project/BatchNorm", 0, 0, {}], ["expanded_conv_4/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/expand", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/expand", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_5/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_36", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_36", "inbound_nodes": [["expanded_conv_5/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_46", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_46", "inbound_nodes": [[["tf.__operators__.add_36", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_36", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_36", "inbound_nodes": [["re_lu_46", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_24", "trainable": true, "dtype": "float32"}, "name": "multiply_24", "inbound_nodes": [[["tf.math.multiply_36", 0, 0, {}], ["expanded_conv_5/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5/depthwise", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_5/depthwise", "inbound_nodes": [[["multiply_24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/depthwise/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/depthwise/BatchNorm", "inbound_nodes": [[["expanded_conv_5/depthwise", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_37", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_37", "inbound_nodes": [["expanded_conv_5/depthwise/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_47", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_47", "inbound_nodes": [[["tf.__operators__.add_37", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_37", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_37", "inbound_nodes": [["re_lu_47", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_25", "trainable": true, "dtype": "float32"}, "name": "multiply_25", "inbound_nodes": [[["tf.math.multiply_37", 0, 0, {}], ["expanded_conv_5/depthwise/BatchNorm", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_5/squeeze_excite/AvgPool", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "expanded_conv_5/squeeze_excite/AvgPool", "inbound_nodes": [[["multiply_25", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_12", "trainable": true, "dtype": "float32", "target_shape": [1, 1, 192]}, "name": "reshape_12", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/AvgPool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv", "inbound_nodes": [[["reshape_12", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_5/squeeze_excite/Relu", "trainable": true, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_5/squeeze_excite/Relu", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/squeeze_excite/Conv_1", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/squeeze_excite/Conv_1", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Relu", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_38", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_38", "inbound_nodes": [["expanded_conv_5/squeeze_excite/Conv_1", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_48", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_48", "inbound_nodes": [[["tf.__operators__.add_38", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_38", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_38", "inbound_nodes": [["re_lu_48", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_5/squeeze_excite/Mul", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_5/squeeze_excite/Mul", "inbound_nodes": [[["multiply_25", 0, 0, {}], ["tf.math.multiply_38", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5/project", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5/project", "inbound_nodes": [[["expanded_conv_5/squeeze_excite/Mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5/project/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5/project/BatchNorm", "inbound_nodes": [[["expanded_conv_5/project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_5/Add", "trainable": true, "dtype": "float32"}, "name": "expanded_conv_5/Add", "inbound_nodes": [[["expanded_conv_4/Add", 0, 0, {}], ["expanded_conv_5/project/BatchNorm", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6/expand", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6/expand", "inbound_nodes": [[["expanded_conv_5/Add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_6/expand/BatchNorm", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_6/expand/BatchNorm", "inbound_nodes": [[["expanded_conv_6/expand", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.__operators__.add_39", "trainable": true, "dtype": "float32", "function": "__operators__.add"}, "name": "tf.__operators__.add_39", "inbound_nodes": [["expanded_conv_6/expand/BatchNorm", 0, 0, {"y": 3.0, "name": null}]]}, {"class_name": "ReLU", "config": {"name": "re_lu_49", "trainable": true, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_49", "inbound_nodes": [[["tf.__operators__.add_39", 0, 0, {}]]]}, {"class_name": "TFOpLambda", "config": {"name": "tf.math.multiply_39", "trainable": true, "dtype": "float32", "function": "math.multiply"}, "name": "tf.math.multiply_39", "inbound_nodes": [["re_lu_49", 0, 0, {"y": 0.16666666666666666, "name": null}]]}, {"class_name": "Multiply", "config": {"name": "multiply_26", "trainable": true, "dtype": "float32"}, "name": "multiply_26", "inbound_nodes": [[["tf.math.multiply_39", 0, 0, {}], ["expanded_conv_6/expand/BatchNorm", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", 